swak4Foam/Examples/RegionSolvers/DLR_A_LTS_with_solid/0.org/burner/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 292;

boundaryField
{
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    burnerwall {
        type compressible::turbulentTemperatureCoupledBaffleMixed;
        value $internalField;
        Tnbr T;
        kappaMethod fluidThermo;
        kappa $kappaMethod;
        kappaName none;
    }
    burnertip {
        $burnerwall;
    }
    wall {
        type zeroGradient;
    }
}


// ************************************************************************* //
